src/Misc/Software/nas-summarize.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: NAS
#+OPTIONS: num:nil H:2


* DIY

* 整机
+ 萬由 UNAS
+ HP ProLiant MicroServer Gen8迷你服务器
* BBS
+ http://www.nas1.cn/forum.php
+ http://www.nasyun.com/
+ http://www.gebi1.com/portal.php
* 系统方案
+ windows
+ ubuntu
+ FreeNAS: https://www.getnas.com/

* 私有云选择
** ownCloud
+ https://linux.cn/article-2494-1-qqmail.html
+ http://www.bkjia.com/Linux/967931.html
+ http://www.hksilicon.com/articles/1074169
* 媒体中心
+ Plex: https://www.plex.tv/
* communication
+ Teamspeak: https://www.teamspeak.com/teamspeak3
* Apple
+ etatalk is a free, open-source implementation of the Apple Filing
  Protocol. It allows Unix-like operating systems to serve as file,
  print and time servers for Macintosh computers.



* 各种方案
+ ubuntu+zfs: http://www.shafa.com/articles/zkoyBu3Z2lm6HyN3.html
+ 


* HP ProLiant MicroServer Gen8迷你服务器
+ https://www.chiphell.com/thread-1196090-1-1.html
+ https://www.v2ex.com/t/236540
+ http://post.smzdm.com/p/177592


* cc
#+begin_src python

#+end_src

#+begin_src c++

#+end_src


#+begin_src sh

#+end_src
