public_html/Misc/Software/nas-summarize.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>NAS</title>
<!-- 2017-02-13 Mon 00:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">NAS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">DIY</a></li>
<li><a href="#sec-2">整机</a></li>
<li><a href="#sec-3">BBS</a></li>
<li><a href="#sec-4">系统方案</a></li>
<li><a href="#sec-5">私有云选择</a>
<ul>
<li><a href="#sec-5-1">ownCloud</a></li>
</ul>
</li>
<li><a href="#sec-6">媒体中心</a></li>
<li><a href="#sec-7">communication</a></li>
<li><a href="#sec-8">Apple</a></li>
<li><a href="#sec-9">各种方案</a></li>
<li><a href="#sec-10">HP ProLiant MicroServer Gen8迷你服务器</a></li>
<li><a href="#sec-11">cc</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">DIY</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">整机</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>萬由 UNAS
</li>
<li>HP ProLiant MicroServer Gen8迷你服务器
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">BBS</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://www.nas1.cn/forum.php">http://www.nas1.cn/forum.php</a>
</li>
<li><a href="http://www.nasyun.com/">http://www.nasyun.com/</a>
</li>
<li><a href="http://www.gebi1.com/portal.php">http://www.gebi1.com/portal.php</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">系统方案</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>windows
</li>
<li>ubuntu
</li>
<li>FreeNAS: <a href="https://www.getnas.com/">https://www.getnas.com/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">私有云选择</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">ownCloud</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="https://linux.cn/article-2494-1-qqmail.html">https://linux.cn/article-2494-1-qqmail.html</a>
</li>
<li><a href="http://www.bkjia.com/Linux/967931.html">http://www.bkjia.com/Linux/967931.html</a>
</li>
<li><a href="http://www.hksilicon.com/articles/1074169">http://www.hksilicon.com/articles/1074169</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">媒体中心</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Plex: <a href="https://www.plex.tv/">https://www.plex.tv/</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">communication</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Teamspeak: <a href="https://www.teamspeak.com/teamspeak3">https://www.teamspeak.com/teamspeak3</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Apple</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>etatalk is a free, open-source implementation of the Apple Filing
Protocol. It allows Unix-like operating systems to serve as file,
print and time servers for Macintosh computers.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">各种方案</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>ubuntu+zfs: <a href="http://www.shafa.com/articles/zkoyBu3Z2lm6HyN3.html">http://www.shafa.com/articles/zkoyBu3Z2lm6HyN3.html</a>
</li>
<li></li>
</ul>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">HP ProLiant MicroServer Gen8迷你服务器</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><a href="https://www.chiphell.com/thread-1196090-1-1.html">https://www.chiphell.com/thread-1196090-1-1.html</a>
</li>
<li><a href="https://www.v2ex.com/t/236540">https://www.v2ex.com/t/236540</a>
</li>
<li><a href="http://post.smzdm.com/p/177592">http://post.smzdm.com/p/177592</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">cc</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>


<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2017-02-13 Mon 00:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
